def prime_number_check(date, divider = 0):

    if divider == 0: #Створення дільника (котрий на одиницю менший від вхідного числа)

        divider = date - 1

    while divider >= 2: #Якщо не знайшлось дільника (окрім 1 і самого себе) програма переходить до наступного блоку else

        if date % divider == 0: #Перевірка чи ділиться без залишку

            print("Число не є простим.")
            return False

        else: #Перевірка чи ділиться з залишком

            return prime_number_check(date, divider - 1) #Функція далі визиває саму себе

    else:

        print("Число просте.Вітаю!!")
        return True

try:  #Перевірка на помилки

    date = int(input("Введіть число: "))
    if date == 1: #Якщо вхідне число == 1

        print("Число 1 має тільки один натуральний дільник(а саме це число).Тому воно не відноситься ні до простих ні до складених.")

    elif date < 1: #Якщо вхідне число < 1

        print(
            "Число не натуральне ,тому і не може бути натуральним простим.")

    else: #Коли перевірка пройдена запускається рекурсивна функція
        prime_number_check(date)

except  ValueError: #Якщо помилка появиться,якщо вхідні дані не число ,або не ціле число

    print('Це не ціле число.Програма завершує свою роботу!')